import React from "react";
import {ReactComponent as SunIcon} from "./images/icons/advantages/sun.svg";
import {ReactComponent as AirplaneIcon} from "./images/icons/advantages/airplane.svg";
import {ReactComponent as SurfingGuyIcon} from "./images/icons/advantages/serfing-guy.svg";
import {ReactComponent as ShortestGraphicIcon} from "./images/icons/advantages/graphics/1.svg";
import {ReactComponent as AverageGraphicIcon} from "./images/icons/advantages/graphics/2.svg";
import {ReactComponent as LongestGraphicIcon} from "./images/icons/advantages/graphics/3.svg";
import slide from "./images/blog.png";
import trainerImg from "./images/trainer.png";

// Advantages Block
export const AdvantagesListData = [
    {
        icon: <SunIcon/>,
        title: 'ПРОЖИВАНИЕ',
        text: 'Наша школа серфинга находится в 100 м от океанского побережья. К услугам гостей открытый бассейн и бесплатный Wi-Fi. Из верхней террасы открывается вид на океан. Расстояние до центра города 15 мин. ',
    },
    {
        icon: <AirplaneIcon/>,
        title: 'ПЕРЕЛЕТ И СТРАХОВКУ',
        text: 'Все участники программы застрахованы страховой компанией Allianz. Перелет из Тенерифе до острова Лансароте  и обратно входит в стоимость программы',
    },
    {
        icon: <SurfingGuyIcon/>,
        title: 'ОБУЧЕНИЕ И ЭКИПИРОВКУ',
        text: 'Все оборудование и экипировка известных производителей и предоставляется на весь курс программы. Тренировочный процесс начинается с определения вашего уровня катания ',
    },
];

export const AdvantagesStatisticsData = [
    {
        icon: <ShortestGraphicIcon/>,
        title: 'Приехали второй раз',
        percents: '85'
    },
    {
        icon: <AverageGraphicIcon/>,
        title: 'Научились кататься',
        percents: '95'
    },
    {
        icon: <LongestGraphicIcon/>,
        title: 'Довольных клиентов',
        percents: '99'
    }
];

export const AdvantagesInfoData = [
    {
        text: 'Огромным преимуществом нашей школы является собственная методика обучения. Мы разработали собственный стиль обучения серфингу, который позволяет новичкам максимально быстро встать на доску.'
    },
    {
        text: 'Именно наша методика и наши преподаватели позволили нам пройти аттестацию Федерации серфинга Канарских островов - FEDERACIÓN CANARIA DE SURF. Это означает, что наша школа соответствует всем мировым стандартам. Переаттестация производится ежегодно и это позволяет нам всегда стремиться к улучшению обучения.'
    },
]


// About Block
export const AboutLeftColumnData = [
    {
        text: 'Канарские острова не случайно называют европейскими Гавайями – это идеальное место для поклонников серфинга: стабильный теплый ветер круглый год, песчаные пляжи, километры нетронутых просторов и прозрачное море. А настоящей Меккой для серфингистов становится Фуэртевентура – второй по величине остров архипелага.',
    },
    {
        text: 'Именно здесь лучшее в Испании место, в котором можно пройти обучение серфингу. Кроме того, что зимой и осенью сюда приходят огромные атлантические волны, Фуэртевентура может похвастать и множеством мелководных спокойных лагун, отлично подходящих для обучения начинающих серфингистов.',
    },
    {
        text: 'Серфинг на Канарских островах доступен круглый год – и волны, и подходящая погода здесь есть всегда. Причем волну, подходящую по уровню, сможет найти и настоящий профи, и новичок. Не случайно считается, что именно это место лучше всего подойдет для обучения здесь возможно без сложностей переходить на новый уровень.',
    },
    {
        text: 'Перечисляя достоинства, нельзя обойти и то, что пляжи Фуэртевентуры самые протяженные на Канарах. В итоге невозможно представить их переполненных туристами. Вы столкнетесь только с теми, кого,как и вас, будет интересовать одна цель – обучение серфингу.',
    },
]

export const AboutRightColumnData = [
    {
        text: 'Пока что вы только хотите понять, что такое серфинг, или уже испытали всю прелесть катания на волнах, но желаете поднять свой уровень? Наша школа серфинга сможет предложить обучение для любого уровня подготовки.',
    },
    {
        text: 'Четыре часа увлекательных занятий в день помогут вам уверенно покорять волны, почувствовать себя настоящим серфингистом.',
    },
    {
        text: 'Основные достоинства нашей русской школы – высокое качество преподавания и организации занятий, безопасность (все наши клиенты застрахованы в компании Allianz), отличный инвентарь и экипировка (предоставляется на весь курс обучения), в том числе мягкие безопасные доски для начинающих.',
    },
    {
        text: 'Сначала мы определяем уровень катания и физической подготовки и только потом составляем программу подготовки. И можем заверить, что после того, как закончится обучение, вы не только получите массу великолепных ощущений, но и это уровень поднимется на новую ступень.',
    },
]

// WhyUs Block
export const WhyUsData = [
    {
        text: 'Преподаватели нашей школы серфинга в числе лучших серферов на Канарских островах. Среди них - чемпион Европы по лонгборду, который с радостью поделится опытом как с новичками, так и более опытными серферами. Все члены преподавательского состава являются сертифицированными членами Федерации серфинга Канарских островов. Некоторые из них знают русский язык, что определенно позиционирует нас как русскую школу серфинга за границей!',
    },
    {
        text: 'Весь тренерский состав регулярно участвует в семинарах и курсах повышения квалификации, которые проводятся по всему миру различными известными серф-клубами и федерациями. Поэтому в нашей школе серфинга вы можете быть спокойны: вас обучают лучшие тренеры!',
    },
    {
        text: 'Методика обучения серфингу рассчитана как на новичков, на серферов среднего уровня, так и на серферов уровня ТОП. Тренеры находят подход к каждому, несмотря на то, что обучение серфингу в нашей школе производится в группах. Однако, мы предлагаем персональные уроки серфинга - только вы и тренер!',
    },
]

// InfoVideo Block
export const InfoVideoData = [
    {
        number: '450',
        text: 'туристов'
    },
    {
        number: '2500',
        text: 'часов катания'
    },
    {
        number: '10',
        text: 'проф. тренеров'
    },
    {
        number: '365',
        text: 'дней в году'
    },
]

// Blog Block
export const BlogData = [
    {
        image: slide,
        title: 'ЧТО НЕОБХОДИМО ВЗЯТЬ С СОБОЙ НА СЕРФ ТУР',
        subtitle: 'ТОП 20 необходимых вещей для комфортного отдыха и обучения'
    },
    {
        image: slide,
        title: 'ЧТО НЕОБХОДИМО ВЗЯТЬ С СОБОЙ НА СЕРФ ТУР',
        subtitle: 'ТОП 20 необходимых вещей для комфортного отдыха и обучения'
    },
    {
        image: slide,
        title: 'ЧТО НЕОБХОДИМО ВЗЯТЬ С СОБОЙ НА СЕРФ ТУР',
        subtitle: 'ТОП 20 необходимых вещей для комфортного отдыха и обучения'
    },
]

// Team Block
export const TeamData = [
    {
        title: 'Mike',
        subtitle: 'Главный инстуктор',
        image: trainerImg,
    },
    {
        title: 'Bob',
        subtitle: 'Инстуктор',
        image: trainerImg,
    },
    {
        title: 'Tim',
        subtitle: 'Инстуктор',
        image: trainerImg,
    },
]